Autodesk.Revit.DB.Family.HasLargeSketches
Checks whether the family contains sketches with a large number of elements.
Remarks:
Families containing large sketches (typically with 300+ elements) may cause
performance problems in parametric families (see Autodesk.Revit.DB.Family.IsParametric).
Thus, before adding any constraints to a family (which will make the family
parametric,) this method can be queried and the decision about whether the
family should indeed be turned parametric may be deferred to the end-user.
Since:
2017

Autodesk.Revit.DB.Family.GetFamilyTypeParameterValues(Autodesk.Revit.DB.ElementId)
Returns all applicable values for a FamilyType parameter of this family.
Remarks:
The values are Element Ids of all family types that match
the category specified by the definition of the given parameter.
The elements are either of class Autodesk.Revit.DB.ElementType or
Autodesk.Revit.DB.NestedFamilyTypeReference. The second variant is
for the types that are nested in families and thus are not
accessible otherwise.
If there are no applicable types of such category the returned
collection will be empty.
parameterId:
A valid Id of a FamilyType parameter defined for this family.
Returns:
Ids of all applicable Autodesk.Revit.DB.ElementType and Autodesk.Revit.DB.NestedFamilyTypeReference elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given parameterId does not represent a valid FamilyType parameter of this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Family.GetFamilySymbolIds
Gets the ids of the FamilySymbols owned by this Family.
Returns:
The ids of the FamilySymbols.
Since:
2015

Autodesk.Revit.DB.Family.IsAppropriateCategoryId(Autodesk.Revit.DB.ElementId)
Identifies if the input category id can be assigned as the new category for this family.
categoryId:
The category id.
Returns:
True if the input category id can be assigned as the new category for this family, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Family.CanHaveStructuralSection
Identifies if this Family can have a structural section.
Returns:
True if the Family can have structural section, false otherwise.
Since:
2016

Autodesk.Revit.DB.Family.IsParametric
Identifies whether the family contains parametric relations
between some of its elements.
Remarks:
A family is parametric if it contains parameter-driven relations between
its elements, such as labeled dimensions or locked tangential joins.
Parametric families containing large sketches may cause performance
problems. Caution is therefore advised before adding any constraints to
a yet non-parametric family that already contains large sketches.
See DoesContainLargeSketches().
Since:
2017

Autodesk.Revit.DB.Family.IsUserCreated
Determine whether the family has been defined by the user.
Remarks:
Some families are created internally and cannot be saved or reloaded.
This function will return False for such internal families.
Since:
2015

Autodesk.Revit.DB.Family.FamilyPlacementType
Identifies the type of placement required by a given family.
Since:
2013

Autodesk.Revit.DB.Family.IsOwnerFamily
True if the family is the owner family for its own editable document, false otherwise.
Since:
2015

Autodesk.Revit.DB.Family.FamilyCategoryId
The id of the category or sub category in which the elements that this family could generate reside.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input category id cannot be assigned as the new category for this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The family is not an owner family for its own editable document.
Since:
2015

Autodesk.Revit.DB.Family.StructuralCodeName
The family's structural code name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Family.StructuralFamilyNameKey
The family's structural section shape name key.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Family.StructuralSectionShape
The family's structural section shape.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This Family cannot have a structural section.
Since:
2015

Autodesk.Revit.DB.Family.StructuralMaterialType
The family's structural material type.

Autodesk.Revit.DB.Family.IsEditable
True if the family supports editing, false otherwise.
Remarks:
The family will not be editable if it is in-place, not saveable, or represents the primary family inside a family document.

Autodesk.Revit.DB.Family.IsInPlace
True if the family is an in-place family, false if the family is a loadable family.

Autodesk.Revit.DB.Family.FamilyCategory
Retrieves or sets a Category object that represents the category or sub category in which the elements
( this family could generate ) reside.
Remarks: All category objects can be retrieved from the application by using the Categories property
of the Application.Settings object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input category cannot be assigned to this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input category is null.

Autodesk.Revit.DB.Family.ExtractPartAtom(System.String)
Writes a PartAtom XML from the contents of a family object.
xmlFilePath: The xml file to be saved.
Throws Autodesk.Revit.Exceptions.ArgumentException: If 'xmlFilePath' is null or an empty string.
Remarks:
This method is designed for a family loaded into a document in session. So it will skip the type catalog file.
To extract the PartAtom XML from a family file on disk, use Application.ExtractPartAtomFromFamilyFile()
Since: 2011

Autodesk.Revit.DB.Family.ShowSpatialElementCalculationPoint
For families that can have a calculation point for spatial elements,
hide or show the calculation point.
Autodesk.Revit.DB.SpatialElementCalculationPoint elements.
Since: 2013

Autodesk.Revit.DB.Family.CurtainPanelVerticalSpacing
For Curtain Panel families, the vertical spacing of the
driving mesh.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this family is not the owner family of a curtain panel family document.

Autodesk.Revit.DB.Family.CurtainPanelHorizontalSpacing
For Curtain Panel families, the horizontal spacing of the
driving mesh.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this family is not the owner family of a curtain panel family document.

Autodesk.Revit.DB.Family.CurtainPanelTilePattern
For Curtain Panel families, the choice of tile pattern.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this family is not a Curtain Panel family.

Autodesk.Revit.DB.Family.IsCurtainPanelFamily
Whether the Family is a Curtain Panel family. Curtain Panel family
symbols are used as the ObjectTypes of
Autodesk.Revit.DB.DividedSurface elements.

Autodesk.Revit.DB.Family.IsConceptualMassFamily
Whether the Family is a Conceptual Mass family.

Autodesk.Revit.DB.Family
An element that represents a custom family (not a system family) in Autodesk Revit.
Remarks:
Custom families within the Revit API represented by three objects - Family, Autodesk.Revit.DB.FamilySymbol
and Autodesk.Revit.DB.FamilyInstance.
Each object plays a significant part in the structure of families. The Family element represents the entire family
that consists of a collection of types, such as an 'I Beam'. You can think of that object as representing the entire
family file. The Family object contains a number of Autodesk.Revit.DB.FamilySymbol elements. The
Autodesk.Revit.DB.FamilySymbol object represents a specific set
of family settings within that Family and represents what is known in the Revit user interface as a
Type, such as 'W14x32'. The Autodesk.Revit.DB.FamilyInstance object represents an actual instance of that
type placed the Autodesk Revit project. For example the Autodesk.Revit.DB.FamilyInstance would
be a single instance of a W14x32 column within the project.